package ru.dolgov;

public class Work5 {
    public static void main(String[] args) {
        Employee[] employee = new Employee[5];//Создания массива из 5 элементов
        employee[0] = new Employee("Долгов Иван Сергеевич", "Инженер-программист",
                "popded0**@gmail.com", "+7908346****", 40000, 26);//Инициализация 1 элемента массива через конструктор класса
        employee[1] = new Employee("Соболева Анна Германовна", "Программист",
                "popded1**@gmail.com", "+7908346****", 80000, 45);//Инициализация 2 элемента массива через конструктор класса
        employee[2] = new Employee("Сидорова Ангелина Михайловна", "Главный Инженер",
                "popded2**@gmail.com", "+7908346****", 50000, 24);//Инициализация 3 элемента массива через конструктор класса
        employee[3] = new Employee("Савельев Роман Владиславович", "Программист",
                "popded3**@gmail.com", "+7908346****", 49000, 48);//Инициализация 4 элемента массива через конструктор класса
        employee[4] = new Employee("Борисов Александр Михайлович", "Программист",
                "popded4**@gmail.com", "+7908346****", 46000, 30);//Инициализация 5 элемента массива через конструктор класса
        for (Employee value : employee) { //Проходим по всему массиву
            if (value.age > 40) { //Сравниваем больше ли возраст 40
                System.out.println(value); // Если больше, то выводим в консоль
            }
        }

    }
}
